export default {  
    //---------------------A-------------------//
    admin: `ผู้ดูแลระบบ`,
    accountNumber: 'หมายเลขบัญชี',
    action: 'จัดการ',
    add: 'เพิ่ม',
    addBlackout: 'เพิ่มวันหยุด',
    amount: `จำนวนเงิน`,
    areYouSureToDeleteBlackout: 'คุณแน่ใจที่จะลบรายการวันหยุดหรือไม่ ?',
    areYouSureToEditOperationTime: 'คุณแน่ใจที่จะบันทึกการแก้ไขเวลาให้บริการหรือไม่ ?',
    atLeastSixCharacters: `อย่างน้อย 6 ตัวอักษร`,
    available: 'ว่าง',
    authentication: `ลงชื่อเข้าใช้`,
    //---------------------B-------------------//
    baht: 'บาท',
    blackout: 'วันหยุด',
    blackoutList: 'รายการวันหยุด',
    blackoutTitle: 'หัวข้อ',
    blackoutTitleEx: 'เช่น. วันสงกรานต์, วันขึ้นปีใหม่',
    booked: 'จองแล้ว',
    booking: `จองสนาม`,
    bookingHistory: `ประวัติการจอง`,
    bookingList: 'ลิสต์การจอง',
    bookingSuccess: `จองสนามสำเร็จ`,
    bookingSummary: 'สรุปการจอง',
    bookingTimestamp: 'เวลาทำการจอง',
    by: 'โดย',
    bye: `ลาก่อน`,
    //---------------------C-------------------//
    cancel: 'ยกเลิก',
    changeScheduleTo: 'เปลี่ยนเวลาเป็น',
    confirm: 'ยืนยัน',
    confirmBooking: 'ยืนยันการจอง',
    confirmPassword: 'ยืนยันรหัสผ่าน',
    confirmMember: 'ยืนยันสมาชิก',
    confirmWarning: '*กรุณาตรวจสอบข้อมูลการโอนเงินให้ถูกต้อง หากยืนยันแล้วจะไม่สามารถแก้ไขได้',
    court: 'สนามที่',
    count: 'จำนวน',
    //---------------------D-------------------//
    date: 'เวลา',
    dateOfBirth: 'วัน/เดือน/ปี เกิด',
    detail: 'รายละเอียด',
    delete: 'ลบ',
    deleteBlackout: 'ลบรายการวันหยุด',
    //---------------------E-------------------//
    edit: 'แก้ไข',
    editBooking: 'เปลี่ยนเวลาจอง',
    editOperationTime: 'แก้ไขเวลาให้บริการ',
    error: 'ผิดพลาด',
    email: 'อีเมลล์',
    end: 'สิ้นสุด',
    endDate: 'วันที่สิ้นสุด',
    exportExcel: 'ดาวน์โหลด Excel',
    //---------------------F-------------------//
    female: 'หญิง',
    firstname: 'ชื่อ',
    fee: 'ค่าบริการ',
    footer: `มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต\n
    80 หมู่ 1 ถนนวิชิตสงคราม, ตำบล กะทู้, จังหวัดภูเก็ต 83120, ประเทศไทย\n
    โทรศัพท์: 0-7627-6012, 0-7627-6013 แฟ๊กซ์: 0-7627-6002\n`,
    //---------------------G-------------------//
    gender: 'เพศ',
    greeting: `สวัสดี`,
    //---------------------H-------------------//
    //---------------------I-------------------//
    income: `รายรับ`,
    incomeSummary: 'สรุปรายรับ',
    incorrectConfirmPassword: `รหัสผ่านยืนยันไม่ถูกต้อง`,
    //---------------------J-------------------//
    //---------------------K-------------------//
    //---------------------L-------------------//
    lastname: 'นามสกุล',
    login: `ล็อคอิน`,
    logout: `ล็อคเอาท์`,
    //--------------------M--------------------//
    male: 'ชาย',
    memberExpires: 'วันหมดอายุสมาชิก',
    //---------------------N-------------------//
    name: 'ชิ่อ - นามสกุล',
    no: 'ไม่ใช่',
    noService: 'งดให้บริการ',
    noServiceOn: 'งดให้บริการทุก ๆ',
    //---------------------O-------------------//
    ok: 'ตกลง',
    operationTime: 'เวลาทำการ',
    operationTimeChanged: 'แก้ไขเวลาให้บริการเรียบร้อย',
    ownerInformation:'PSU Passport หรือ เบอร์โทรศัพท์ผู้จอง',
    ownerName:'ชื่อผู้จอง',
    ownerType:'ประเภทผู้จอง',
    //---------------------P-------------------//
    passed: 'ผ่านแล้ว',
    password: `รหัสผ่าน`,
    phoneNumber: 'เบอร์โทรศัพท์',
    phoneNumberOrPSUPassport: `เบอร์โทรศัพท์ หรือ PSU Passport`,
    pleaseLogin: 'กรุณาลงชื่อเข้าใช้',
    pleaseInput: 'กรุณาระบุ',
    pleaseInputYour: 'กรุณาระบุ',
    pleasePayTo: 'กรุณาชำระเงินที่หมายเลขบัญชี',
    position: 'ประเภทผู้ใช้',
    //---------------------Q-------------------//
    //---------------------R-------------------//
    register: `สมัครสมาชิก`,
    registerSuccess: 'สมัครสมาชิกเสร็จเรียบร้อย',
    reload: 'โหลดหน้าใหม่',
    rememberMe: `ให้ฉันอยู่ในระบบต่อไป`,
    reset: 'รีเซ็ท',
    //---------------------S-------------------//
    s:'',
    save: 'บันทึก',
    scbAccount: `857-219-6068\n
    ธนาคารไทยพาณิชญ์\n
    มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต`,
    search: 'ค้นหา',
    searchBooking: 'ค้นหาการจอง',
    selected: 'เลือกแล้ว',
    serviceFee: 'ค่าบริการ',
    slot: 'ช่อง',
    sport: 'ชนิดกีฬา',
    start: 'เริ่มต้น',
    startDate: 'วันที่เริ่มต้น',
    stadium: 'สนาม',
    success: 'สำเร็จ',
    //---------------------T-------------------//
    transferTime: `เวลาที่โอน`,
    transactinoNotFoundDetail: `ไม่พบรายการชำระเงินของท่าน ระบบจะทำการตรวจสอบภายใน 20 นาทีนี้\n
    สามารถสอบถามรายละเอียดเพิ่มเติมได้ที่ โทร. 08-6457-3098`,
    tenCharactersPhoneNumber: 'เบอร์โทรศัพท์ประกอบด้วย 10 ตัวเลข',
    total: 'รวมทั้งสิ้น',
    toMember: 'ทำให้เป็นสมาชิก',
    //---------------------U-------------------//
    unauthorizedDetail: 'Session หมดอายุ หรือมีผู้อื่นล็อคอินด้วยบัญชีนี้ กรุณาโหลดหน้าใหม่เพื่อดำเนินการต่อ',
    updateScheduleSuccess: 'แก้ไขเวลาจองเรียบร้อย',
    user: 'ผู้ใช้',
    userList: 'รายชื่อผู้ใช้',
    upgradeUserSuccess: 'สร้างสมาชิกสำเร็จ',
    //---------------------V-------------------//
    //---------------------W-------------------//
    //---------------------X-------------------//
    //---------------------Y-------------------//
    yes: 'ใช่',
    //---------------------Z-------------------//

    //เดือน
    january: 'มกราคม',
    febuary: 'กุมภาพันธ์',
    march: 'มีนาคม',
    april: 'เมษายน',
    may: 'พฤษภาคม',
    june: 'มิถุนายน',
    july: 'กรกฎาคม',
    august: 'สิงหาคม',
    sebtember: 'กันยายน',
    october: 'ตุลาคม',
    november: 'พฤศจิกายน',
    december: 'ธันวาคม',

    //วัน
    monday: 'วันจันทร์',
    tuesday: 'วันอังคาร',
    wednesday: 'วันพุธ',
    thursday: 'วันพฤหัสบดี',
    friday: 'วันศุกร์',
    saturday: 'วันเสาร์',
    sunday: 'วันอาทิตย์',

    //ประเภทผู้ใช้
    admin: 'เจ้าหน้าที่',
    generalPublic: 'บุคคลทั่วไป',
    member: 'สมาชิก',
    staff: 'บุคลากร',
    student: 'นักศึกษา',

    //กีฬา
    all: 'ทั้งหมด',
    badminton: 'แบดมินตัน',
    basketball: 'บาสเกตบอล',
    tabletennis: 'เทเบิลเทนนิส',
    tennis: 'เทนนิส',
    swimming: 'ว่ายน้ำ',
    volleyball: 'วอลเลย์บอล',

    
    
}